zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_ll_rcc.c
  /*!< MLHCLK clock frequency */
  RCC_Clocks->MLHCLK_Frequency = RCC_GetMLHCLKClockFreq(RCC_Clocks->MCUSS_Frequency);

  /*!< PCLK1 clock frequency */
  RCC_Clocks->PCLK1_Frequency = RCC_GetPCLK1ClockFreq(RCC_Clocks->MLHCLK_Frequency);

  /*!< PCLK2 clock frequency */
  RCC_Clocks->PCLK2_Frequency = RCC_GetPCLK2ClockFreq(RCC_Clocks->MLHCLK_Frequency);

  /*!< PCLK3 clock frequency */
  RCC_Clocks->PCLK3_Frequency = RCC_GetPCLK3ClockFreq(RCC_Clocks->MLHCLK_Frequency);

  /*!< PCLK4 clock frequency */
  RCC_Clocks->PCLK4_Frequency = RCC_GetPCLK4ClockFreq(RCC_Clocks->ACLK_Frequency);

  /*!< PCLK5 clock frequency */
  RCC_Clocks->PCLK5_Frequency = RCC_GetPCLK5ClockFreq(RCC_Clocks->ACLK_Frequency);

  /*!< HCLK1 clock frequency */
  RCC_Clocks->HCLK1_Frequency = RCC_Clocks->MLHCLK_Frequency;

  /*!< HCLK2 clock frequency */
  RCC_Clocks->HCLK2_Frequency = RCC_Clocks->MLHCLK_Frequency;

  /*!< HCLK3 clock frequency */
  RCC_Clocks->HCLK3_Frequency = RCC_Clocks->MLHCLK_Frequency;

  /*!< HCLK4 clock frequency */
  RCC_Clocks->HCLK4_Frequency = RCC_Clocks->MLHCLK_Frequency;

  /*!< MCU clock frequency */
  RCC_Clocks->MCU_Frequency = RCC_Clocks->MLHCLK_Frequency;

  /*!< HCLK5 clock frequency */
  RCC_Clocks->HCLK5_Frequency = RCC_Clocks->ACLK_Frequency;

  /*!< HCLK6 clock frequency */
  RCC_Clocks->HCLK6_Frequency = RCC_Clocks->ACLK_Frequency;
}

/**
  * @brief  Return PLL1 clocks frequencies
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or
  *         oscillator not ready.
  *         For PLL1Q and PLL1R LL_RCC_PERIPH_FREQUENCY_NO is returned as these
  *         outputs are not available.
  * @retval None
  */
void LL_RCC_GetPLL1ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO, pllsource;
  uint32_t m, n, fracv = 0U;

  /* Fout1_ck = ((HSE_VALUE or HSI_VALUE/HSIDIV) / PLLM) * (PLLN + (FRACV/(2^13)))
   * Where Fout1_ck is the PLL1 frequency before PQR post-dividers
   * PLL_P_Frequency = Fout1_ck/DIVP (if output enabled)
   */

  pllsource = LL_RCC_PLL12_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL12SOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        pllinputfreq = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_PLL12SOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        pllinputfreq = HSE_VALUE;
      }
      break;

    case LL_RCC_PLL12SOURCE_NONE:
    default:
      /* PLL12 clock disabled */
      break;
  }

  PLL_Clocks->PLL_P_Frequency = 0U;
  PLL_Clocks->PLL_Q_Frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  PLL_Clocks->PLL_R_Frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  m = LL_RCC_PLL1_GetM();
  n = LL_RCC_PLL1_GetN();
  if (LL_RCC_PLL1FRACV_IsEnabled() != 0U)
  {
    fracv = LL_RCC_PLL1_GetFRACV();
  }

  if (m != 0U)
  {
    if (LL_RCC_PLL1P_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_P_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL1_GetP());
    }
  }
}

/**
  * @brief  Return PLL2 clocks frequencies
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or
  *         oscillator not ready
  * @retval None
  */
void LL_RCC_GetPLL2ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO, pllsource;
  uint32_t m, n, fracv = 0U;

  /* Fout2_ck = ((HSE_VALUE or HSI_VALUE/HSIDIV) / PLLM) * (PLLN + (FRACV/(2^13)))
   * Where Fout2_ck is the PLL2 frequency before PQR post-dividers
   * PLL_P_Frequency = Fout2_ck/DIVP (if output enabled)
   * PLL_Q_Frequency = Fout2_ck/DIVQ (if output enabled)
   * PLL_R_Frequency = Fout2_ck/DIVR (if output enabled)
   */
  pllsource = LL_RCC_PLL12_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL12SOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        pllinputfreq = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_PLL12SOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        pllinputfreq = HSE_VALUE;
      }
      break;

    case LL_RCC_PLL12SOURCE_NONE:
    default:
      /* PLL12 clock disabled */
      break;
  }

  PLL_Clocks->PLL_P_Frequency = 0U;
  PLL_Clocks->PLL_Q_Frequency = 0U;
  PLL_Clocks->PLL_R_Frequency = 0U;

  m = LL_RCC_PLL2_GetM();
  n = LL_RCC_PLL2_GetN();
  if (LL_RCC_PLL2FRACV_IsEnabled() != 0U)
  {
    fracv = LL_RCC_PLL2_GetFRACV();
  }

  if (m != 0U)
  {
    if (LL_RCC_PLL2P_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_P_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL2_GetP());
    }

    if (LL_RCC_PLL2Q_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_Q_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL2_GetQ());
    }

    if (LL_RCC_PLL2R_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_R_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL2_GetR());
    }
  }
}

/**
  * @brief  Return PLL3 clocks frequencies
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or
  *         oscillator not ready
  * @retval None
  */
void LL_RCC_GetPLL3ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO, pllsource;
  uint32_t m, n, fracv = 0U;

  /* Fout3_ck = ((HSE_VALUE, CSI_VALUE or HSI_VALUE/HSIDIV) / PLLM) * (PLLN + (FRACV/(2^13)))
   * Where Fout3_ck is the PLL3 frequency before PQR post-dividers
   * PLL_P_Frequency = Fout3_ck/DIVP (if output enabled)
   * PLL_Q_Frequency = Fout3_ck/DIVQ (if output enabled)
   * PLL_R_Frequency = Fout3_ck/DIVR (if output enabled)
   */

  pllsource = LL_RCC_PLL3_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL3SOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        pllinputfreq = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_PLL3SOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        pllinputfreq = HSE_VALUE;
      }
      break;

    case LL_RCC_PLL3SOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        pllinputfreq = CSI_VALUE;
      }
      break;

    case LL_RCC_PLL3SOURCE_NONE:
    default:
      /* PLL3 clock disabled */
      break;
  }

  PLL_Clocks->PLL_P_Frequency = 0U;
  PLL_Clocks->PLL_Q_Frequency = 0U;
  PLL_Clocks->PLL_R_Frequency = 0U;

  m = LL_RCC_PLL3_GetM();
  n = LL_RCC_PLL3_GetN();
  if (LL_RCC_PLL3FRACV_IsEnabled() != 0U)
  {
    fracv = LL_RCC_PLL3_GetFRACV();
  }

  if (m != 0U)
  {
    if (LL_RCC_PLL3P_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_P_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL3_GetP());
    }

    if (LL_RCC_PLL3Q_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_Q_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracv, LL_RCC_PLL3_GetQ());
    }

