zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_ll_rcc.c
  switch (LL_RCC_GetCECClockSource(CECxSource))
  {
    case LL_RCC_CEC_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        cec_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_CEC_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        cec_frequency = LSI_VALUE;
      }
      break;

    case LL_RCC_CEC_CLKSOURCE_CSI122:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        cec_frequency = (CSI_VALUE / 122U);
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return cec_frequency;
}

/**
  * @brief  Return USBPHYx clock frequency
  * @param  USBPHYxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE
  * @retval USBPHY clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSBPHYClockFreq(uint32_t USBPHYxSource)
{
  uint32_t usbphy_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_USBPHY_CLKSOURCE(USBPHYxSource));

  switch (LL_RCC_GetUSBPHYClockSource(USBPHYxSource))
  {
    case LL_RCC_USBPHY_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        usbphy_frequency = HSE_VALUE;
      }
      break;

    case LL_RCC_USBPHY_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        usbphy_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_USBPHY_CLKSOURCE_HSE2:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        usbphy_frequency = (HSE_VALUE / 2U);
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return usbphy_frequency;
}

/**
  * @brief  Return USBOx clock frequency
  * @param  USBOxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBO_CLKSOURCE
  * @retval USBO clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSBOClockFreq(uint32_t USBOxSource)
{
  uint32_t usbo_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_USBO_CLKSOURCE(USBOxSource));

  switch (LL_RCC_GetUSBOClockSource(USBOxSource))
  {
    case LL_RCC_USBO_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        usbo_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_USBO_CLKSOURCE_PHY:
      usbo_frequency = USBO_48M_VALUE; /* rcc_ck_usbo_48m */
      break;

    default:
      /* Nothing to do */
      break;
  }

  return usbo_frequency;
}

/**
  * @brief  Return RNGx clock frequency
  * @param  RNGxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE
  *         @arg @ref LL_RCC_RNG2_CLKSOURCE
  * @retval RNG clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetRNGClockFreq(uint32_t RNGxSource)
{
  uint32_t rng_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_RNG_CLKSOURCE(RNGxSource));

  switch (LL_RCC_GetRNGClockSource(RNGxSource))
  {
    case LL_RCC_RNG1_CLKSOURCE_CSI:
    case LL_RCC_RNG2_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        rng_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_RNG1_CLKSOURCE_PLL4R:
    case LL_RCC_RNG2_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        rng_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_RNG1_CLKSOURCE_LSE:
    case LL_RCC_RNG2_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        rng_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_RNG1_CLKSOURCE_LSI:
    case LL_RCC_RNG2_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        rng_frequency = LSI_VALUE;
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return rng_frequency;
}

/**
  * @brief  Return CKPERx clock frequency
  * @param  CKPERxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE
  * @retval CKPER clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetCKPERClockFreq(uint32_t CKPERxSource)
{
  uint32_t ckper_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_CKPER_CLKSOURCE(CKPERxSource));

  switch (LL_RCC_GetCKPERClockSource(CKPERxSource))
  {
    case LL_RCC_CKPER_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        ckper_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        ckper_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        ckper_frequency = HSE_VALUE;
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_OFF:
    default:
      /* Nothing to do */
      break;
  }

  return ckper_frequency;
}

/**
  * @brief  Return STGENx clock frequency
  * @param  STGENxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE
  * @retval STGEN clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSTGENClockFreq(uint32_t STGENxSource)
{
  uint32_t stgen_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_STGEN_CLKSOURCE(STGENxSource));

  switch (LL_RCC_GetSTGENClockSource(STGENxSource))
  {
    case LL_RCC_STGEN_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        stgen_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

