zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_ll_rcc.c
    case LL_RCC_SAI1_CLKSOURCE_PER:
      dfsdm_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_SAI1_CLKSOURCE_PLL3R:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        dfsdm_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return dfsdm_frequency;
}

/**
  * @brief  Return LTDC kernel clock frequency
  * @retval LTDC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetLTDCClockFreq(void)
{
  uint32_t ltdc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  if (LL_RCC_PLL4_IsReady() != 0U)
  {
    LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
    ltdc_frequency = PLL_Clocks.PLL_Q_Frequency;
  }

  return ltdc_frequency;
}

/**
  * @brief  Return RTC clock frequency
  * @retval RTC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetRTCClockFreq(void)
{
  uint32_t rtc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* RTCCLK clock frequency */
  switch (LL_RCC_GetRTCClockSource())
  {
    case LL_RCC_RTC_CLKSOURCE_LSE:     /* LSE clock used as RTC clock source */
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        rtc_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_LSI:     /* LSI clock used as RTC clock source */
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        rtc_frequency = LSI_VALUE;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_HSE_DIV: /* HSE clock used as RTC clock source */
      rtc_frequency = (HSE_VALUE / (LL_RCC_GetRTC_HSEPrescaler() + 1U));
      break;

    case LL_RCC_RTC_CLKSOURCE_NONE:    /* No clock used as RTC clock source */
    default:
      /* Nothing to do */
      break;
  }

  return rtc_frequency;
}

/**
  * @brief  Return TIMGx clock frequency
  * @param  TIMGxPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMG1PRES
  *         @arg @ref LL_RCC_TIMG2PRES
  *@note    LL_RCC_TIMG1PRES returns the frequency of the prescaler of timers
  *         located into APB1 domain. It concerns TIM2, TIM3, TIM4, TIM5, TIM6,
  *         TIM7, TIM12, TIM13 and TIM14 frequencies.
  *         LL_RCC_TIMG2PRES returns the frequency of the prescaler of timers
  *         located into APB2 domain. It concerns TIM1, TIM8, TIM15, TIM16, and
  *         TIM17.
  * @retval TIMGx clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetTIMGClockFreq(uint32_t TIMGxPrescaler)
{
  uint32_t timg_frequency, apb1_div;

  /* Check parameter */
  assert_param(IS_LL_RCC_TIMGPRES(TIMGxPrescaler));

  timg_frequency = RCC_GetMLHCLKClockFreq(RCC_GetMCUSSClockFreq());
  apb1_div = LL_RCC_GetAPB1Prescaler();

  switch (LL_RCC_GetTIMGPrescaler(TIMGxPrescaler))
  {
    case LL_RCC_TIMG1PRES_ACTIVATED:
    case LL_RCC_TIMG2PRES_ACTIVATED:
      switch (apb1_div)
      {
        case LL_RCC_APB1_DIV_1:
        case LL_RCC_APB1_DIV_2:
        case LL_RCC_APB1_DIV_4:
          break;
        case LL_RCC_APB1_DIV_8:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB1_DIV_16:
          timg_frequency /= 4U;
          break;
      }
      break;

    case LL_RCC_TIMG1PRES_DEACTIVATED:
    case LL_RCC_TIMG2PRES_DEACTIVATED:
      switch (apb1_div)
      {
        case LL_RCC_APB1_DIV_1:
        case LL_RCC_APB1_DIV_2:
          break;
        case LL_RCC_APB1_DIV_4:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB1_DIV_8:
          timg_frequency /= 4U;
          break;
        case LL_RCC_APB1_DIV_16:
          timg_frequency /= 8U;
          break;
      }
      break;

    default:
      timg_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  return timg_frequency;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RCC_LL_Private_Functions
  * @{
  */

/**
  * @brief  Return MPUSS clock frequency
  * @retval MPUSS clock frequency (in Hz)
  */
uint32_t RCC_GetMPUSSClockFreq(void)
{
  uint32_t frequency = 0U, mpudiv;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get MPUSS source -------------------------------------------------------*/
  switch (LL_RCC_GetMPUClkSource())
  {
    case LL_RCC_MPU_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_MPU_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_MPU_CLKSOURCE_PLL1:
      LL_RCC_GetPLL1ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    case LL_RCC_MPU_CLKSOURCE_MPUDIV:
      mpudiv = LL_RCC_GetMPUPrescaler();
      if (mpudiv != LL_RCC_MPU_DIV_OFF)
      {
        LL_RCC_GetPLL1ClockFreq(&PLL_Clocks);
        frequency = (PLL_Clocks.PLL_P_Frequency >> mpudiv);
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return frequency;
}

/**
  * @brief  Return AXISS clock frequency
  * @retval AXISS clock frequency (in Hz)
  */
uint32_t RCC_GetAXISSClockFreq(void)
{
  uint32_t frequency = 0U;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get AXISS source -------------------------------------------------------*/
  switch (LL_RCC_GetAXISSClkSource())
  {
    case LL_RCC_AXISS_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_AXISS_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_AXISS_CLKSOURCE_PLL2:
      LL_RCC_GetPLL2ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    case LL_RCC_AXISS_CLKSOURCE_OFF:
    default:
      /* Nothing to do */
      break;
  }

  return frequency;
}

/**
  * @brief  Return MCUSS clock frequency
  * @retval MCUSS clock frequency (in Hz)
  */
uint32_t RCC_GetMCUSSClockFreq()
{
  uint32_t frequency = 0U;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get MCUSS source -------------------------------------------------------*/
  switch (LL_RCC_GetMCUSSClkSource())
  {
    case LL_RCC_MCUSS_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_MCUSS_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_MCUSS_CLKSOURCE_CSI:
      frequency = CSI_VALUE;
      break;

    case LL_RCC_MCUSS_CLKSOURCE_PLL3:
      LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    default:
      /* Nothing to do */
      break;
  }

